{
    "translation": {
        "welcome_message": "Hi, nice to meet you, I'm",
        "position": "Full-Stack web developer",
        "about": "About",
        "about_me": "About Me",
        "about_text": "+2 years of experience as a Front-end developer. \n +1 year of experience as a Full-stack developer. \n Qualified to take requirements and offer possible solutions to customers. Open to new ideas to develop a certain feaute. Appreciate feedback and take it into consideration.\n\n I'm ready to give you my best. \n From Punta Arenas, Chile.",
        "skills": "Skills",
        "projects": "Projects",
        "technologies": "Technologies",
        "more info": "More info",
        "hhrr": {
            "intro": "Web app developed in MERN stack, using Redux for state management, login based on jsonwebtoken and file upload with multer. Styling with Css and Bootstrap 4. As it is Software with confidential information of a company, images will be presented instead of the code or a trial version.",
            "login": "First of all there's a login page, which is automatically skipped if the user was previously logged in and has a valid token. There's 3 different roles: HR user, Risk Prevention user and Supervisor user.",
            "roles": "HR are the only one who can add new entries and delete, RP are the ones who fill the exams and certifications for some tools, Supervisor can only read general info for possible hirings.",
            "home": "Then the main screen is displayed, which includes a paginated table with all the employees entries including text fields to be able to filter. There's a previous filter according to the type of user logged in. Workers qualified as unwanted are highlighted in red.",
            "disclaimer": "The information presented below is fictitious.",
            "modal_1": "Double-clicking on a record opens a Modal (react-modal) with a form with the employee's information.",
            "modal_2": "At the bottom of the modal, there is a more information section, in which there is a select that renders conditionally another components based on the chosen option. Some examples:",
            "academic": "Academic information",
            "tools": "Authorized Tools",
            "moreinfo": "Where each one has information related to the selected option. There's an option to upload a file to each record if that's necessary, such as a certificate or anything related.",
            "implementation": "The company preferred the implementation of a local server, which was configured by the IT Manager.",
            "closemodal": "Close"
        }
    }
}